book_api/app/controllers/application_controller.rb

    def require_token
        token = params.require(:auth_token)
        @current_user = User.find_by( auth_token: token )
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "SkC8JxmkQXGcwTPGCk1Ha6kU"], ["LIMIT", 1]]