book_api/app/controllers/sessions_controller.rb

    def create
        @user = User.find_by({email: session_params[:email] })
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "nadiamuh@hotmail.com"], ["LIMIT", 1]]