book_api/app/controllers/users_controller.rb

  def create

    puts"\n\n\n\n _______" , user_params
    @user = User.create!(user_params)
---
INSERT INTO "users" ("name", "password_digest", "auth_token", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"